Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
Creates a new FormatOptions object that represents custom formatting.
unitTypeId:
Identifier of the unit to display.
symbolTypeId:
Identifier of the symbol with which to render the unit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
symbolTypeId is not a valid symbol for unitTypeId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.ForgeTypeId)
Creates a new FormatOptions object that represents custom formatting.
unitTypeId:
Identifier of the unit to display.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014